Repository: SultonbekPGMR/finance_tracker
Catalog: lib/core/l10n/intl_*.arb
Languages: uz

source: Error
uz: Xatolik

source: Success
uz: Muvaffaqiyat

source: Warning
uz: Ogohlantirish

source: Info
uz: Ma'lumot

source: Welcome Back
uz: Xush kelibsiz

# passwordHint
source: Password
uz: Parol

source: Sign In
uz: Kirish

# dontHaveAccount
source: Don't have an account?
uz: Hisobingiz yo'qmi?

source: Sign Up
uz: Ro'yxatdan o'tish

source: Create Account
uz: Hisob yaratish

# confirmPasswordHint
source: Confirm Password
uz: Parolni tasdiqlash

source: Register
uz: Ro'yxatdan o'tish

# haveAccount
source: Do you have an account?
uz: Hisobingiz bormi?

source: Login
uz: Kirish

source: Passwords don't match
uz: Parollar mos emas

# records
source: Expenses
uz: Xarajatlar

source: Charts
uz: Statistika

source: Reports
uz: Hisobotlar

source: Profile
uz: Profil

source: Add Expense
uz: Xarajat qo'shish

source: Amount
uz: Miqdor

source: Enter amount
uz: Miqdor kiriting

# pleaseEnterAmount
source: Please enter an amount
uz: Iltimos, miqdor kiriting

# pleaseEnterValidAmount
source: Please enter a valid amount
uz: Iltimos, to'g'ri miqdor kiriting

source: Category
uz: Turkum

# selectCategory
source: Select a category
uz: Turkumni tanlang

# pleaseSelectCategory
source: Please select a category
uz: Iltimos, turkum tanlang

source: Description
uz: Izoh

source: Enter description
uz: Izoh kiriting

# pleaseEnterDescription
source: Please enter a description
uz: Iltimos, izoh kiriting

source: Save
uz: Saqlash

source: Adding...
uz: Qo'shilmoqda...

source: Saving...
uz: Saqlanmoqda...

source: Expense added successfully
uz: Xarajat muvaffaqiyatli qo'shildi

source: Expense updated successfully
uz: Xarajat muvaffaqiyatli yangilandi

source: Failed to load categories
uz: Turkumlarni yuklashda xatolik

source: Failed to add expense
uz: Xarajat qo'shishda xatolik

source: No expenses found
uz: Xarajatlar topilmadi

source: Search expenses...
uz: Xarajatlarni qidirish...

source: All Categories
uz: Barcha turkumlar

source: Loading expenses...
uz: Xarajatlar yuklanmoqda...

source: Error loading expenses
uz: Xarajatlarni yuklashda xatolik

# totalSpent
source: Total Spent: {amount}
uz: Jami sarflangan: {amount}

source: Select Month
uz: Oy tanlang

source: Today
uz: Bugun

source: Yesterday
uz: Kecha

# dayTotal
source: Expenses: {amount}
uz: Xarajatlar: {amount}

source: No description
uz: Izoh yo'q

source: Expenses
uz: Xarajatlar

source: Income
uz: Daromad

source: Retry
uz: Qayta urinib ko'rish

# startAddingExpenses
source: Start by adding your first expense
uz: Birinchi xarajatingizni qo'shishdan boshlang

source: Edit
uz: Tahrirlash

source: Delete
uz: O'chirish

source: Delete Expense
uz: Xarajatni o'chirish

# deleteConfirmation
source: Are you sure you want to delete this expense?
uz: Haqiqatan ham bu xarajatni o'chirmoqchimisiz?

source: Cancel
uz: Bekor qilish

# deleteSuccess
source: Expense deleted successfully
uz: Xarajat muvaffaqiyatli o'chirildi

# deleteError
source: Error deleting expense
uz: Xarajatni o'chirishda xatolik

# updateError
source: Error updating expense
uz: Xarajatni yangilashda xatolik

source: Update Expense
uz: Xarajatni yangilash

source: Preferences
uz: Sozlamalar

source: Theme
uz: Mavzu

source: Language
uz: Til

source: Currency
uz: Valyuta

source: Notifications
uz: Bildirishnomalar

source: Edit Name
uz: Ismni tahrirlash

source: Set Name
uz: Ism belgilash

source: Display Name
uz: Ko'rsatiladigan ism

source: Select Theme
uz: Mavzuni tanlang

source: Select Language
uz: Tilni tanlang

source: Select Currency
uz: Valyutani tanlang

source: Light
uz: Yorug'

source: Dark
uz: Qorong'i

source: System
uz: Tizim

source: Export Data
uz: Ma'lumotlarni eksport qilish

source: Sign Out
uz: Chiqish

# signOutConfirmation
source: Are you sure you want to sign out?
uz: Haqiqatan ham chiqmoqchimisiz?

source: Error loading profile
uz: Profilni yuklashda xatolik

source: Select Date
uz: Sanani tanlang

# dateHint
source: Choose expense date
uz: Xarajat sanasini tanlang

# pleaseSelectDate
source: Please select a date
uz: Iltimos, sanani tanlang

# badRequest
source: Invalid request
uz: Yaroqsiz so'rov

# unauthorized
source: Unauthorized access
uz: Ruxsatsiz kirish

# forbidden
source: Access forbidden
uz: Kirish taqiqlangan

# notFound
source: Resource not found
uz: Resurs topilmadi

# networkError
source: Network error occurred
uz: Tarmoq xatosi yuz berdi

# requestCancelled
source: Request was cancelled
uz: So'rov bekor qilindi

source: Data format error
uz: Ma'lumotlar formati xatosi

# unknownError
source: An unknown error occurred
uz: Noma'lum xatolik yuz berdi

# authenticationError
source: Authentication error occurred
uz: Autentifikatsiya xatosi yuz berdi

source: User not found
uz: Foydalanuvchi topilmadi

# invalidCredentials
source: Invalid email or password
uz: Yaroqsiz elektron pochta yoki parol

# emailAlreadyInUse
source: Email is already in use
uz: Elektron pochta allaqachon ishlatilmoqda

# weakPassword
source: Password is too weak
uz: Parol juda zaif

# tooManyRequests
source: Too many requests. Please try again later
uz: Juda ko'p so'rovlar. Iltimos, keyinroq qayta urinib ko'ring

source: No internet connection
uz: Internet aloqasi yo'q

# userDisabled
source: This account has been disabled
uz: Ushbu hisob o'chirib qo'yilgan

# operationNotAllowed
source: This operation is not allowed
uz: Ushbu operatsiyaga ruxsat berilmagan

# invalidPassword
source: Wrong password
uz: Parol xato

# serverError
source: Server error occurred
uz: Server xatosi yuz berdi

source: Connection timeout
uz: Ulanish vaqti tugadi

source: Expense not found
uz: Xarajat topilmadi

# invalidAmountWithValue
source: Invalid amount: {amount}
uz: Yaroqsiz miqdor: {amount}

source: Category not found
uz: Turkum topilmadi

# storageError
source: Storage error occurred
uz: Saqlash xatosi yuz berdi

source: Permission denied
uz: Ruxsat rad etildi

# unknownErrorWithDetails
source: Unknown error: {details}
uz: Noma'lum xatolik: {details}

source: Expenses by Category
uz: Turkumlarga bo'lingan xarajatlar

source: Category Breakdown
uz: Turkumlar taqsimoti

# transactionCount
source: {count} transactions
uz: {count} ta tranzaksiya

# selectMonthToView
source: Select a month to view statistics
uz: Statistikani ko'rish uchun oyni tanlang

# selectedCategory
source: Currently selected
uz: Hozir tanlangan

# topSpendingCategory
source: Highest spending category
uz: Eng ko'p sarflangan turkum

source: Daily Expenses Trend
uz: Kunlik xarajatlar tendentsiyasi

source: Category Comparison
uz: Turkumlarni taqqoslash

# swipeToViewCharts
source: Swipe to view different charts
uz: Turli diagrammalarni ko'rish uchun suring

source: Spending Progress
uz: Xarajatlar grafigi

# monthlyHeatmap
source: Monthly Spending Pattern
uz: Oylik xarajatlar xaritasi

# dailyAverage
source: Daily Avg
uz: Kunlik O'rtacha

source: Highest Day
uz: Eng Yuqori Kun

# lightSpending
source: Light
uz: Kam

# heavySpending
source: Heavy
uz: Ko'p

# dailyExpenseReminderTitle
source: 💰 Don’t forget today’s spend!
uz: 💰 Bugungi xarajatingizni kiritdingizmi?

# dailyExpenseReminderBody
source: Add your expenses 🪙 and keep your budget on track 📊
uz: Moliyaviy holatingizni kuzatib borish uchun xarajatlaringizni qo'shing 🪙 va byudjetingizni nazorat qiling 📊

source: Forgot Password
uz: Parolni unutdingizmi

source: Password reset email sent
uz: Parolni tiklash havolasi elektron pochtangizga yuborildi.

# forgotPasswordTitle
source: Reset Password
uz: Parolni tiklash

# forgotPasswordMessage
source: Enter your email address and we'll send you a link to reset your password
uz: Elektron pochta manzilingizni kiriting va biz sizga parolni tiklash havolasini yuboramiz

# emailRequired
source: Email is required
uz: Elektron pochta talab qilinadi

# invalidEmail
source: Please enter a valid email
uz: Iltimos, haqiqiy elektron pochta manzilini kiriting

source: Send Reset Link
uz: Tiklash havolasini yuborish

source: Pie Chart
uz: Dumaloq

source: Bar Chart
uz: Ustunli

source: Line Chart
uz: Chiziqli Diagramma

source: Trend Chart
uz: Trend Diagrammasi

source: Quick Stats
uz: Tezkor Statistikalar

source: Avg per Transaction
uz: Har bir tranzaksiya uchun o'rtacha

source: Highest Category
uz: Eng yuqori turkum

source: Lowest Category
uz: Eng past turkum

source: Sort by
uz: Saralash

# sortByAmount
source: Amount
uz: Miqdor bo'yicha

# sortByCount
source: Count
uz: Soni bo'yicha

# sortByName
source: Name
uz: Nom bo'yicha

source: Filter Categories
uz: Turkumlarni filtrlash

source: Show All
uz: Hammasini ko'rsatish

# categoryFood
source: Food
uz: Oziq-ovqat

# categoryEntertainment
source: Entertainment
uz: Ko'ngilochar

# categoryUtilities
source: Utilities
uz: Kommunal to'lovlar

# categoryShopping
source: Shopping
uz: Xaridlar

# categoryHealth
source: Health
uz: Salomatlik

# categoryEducation
source: Education
uz: Ta'lim

# categoryTravel
source: Travel
uz: Sayohat

# categoryHome
source: Home
uz: Uy-ro'zg'or

# categoryFitness
source: Fitness
uz: Fitnes

# categoryOther
source: Other
uz: Boshqa

source: Good Morning
uz: Xayrli tong

source: Good Afternoon
uz: Xayrli kun

source: Good Evening
uz: Xayrli kech

source: Loading dashboard...
uz: Boshqaruv paneli yuklanmoqda...

source: Failed to load dashboard
uz: Boshqaruv panelini yuklashda xatolik

source: Initializing dashboard...
uz: Boshqaruv paneli ishga tushirilmoqda...

source: spent this month
uz: shu oyda sarflandi

# daysRemaining
source: {count} days remaining
uz: {count} kun qoldi

# todayLabel
source: Today
uz: Bugun

source: This Week
uz: Shu hafta

source: Daily Avg
uz: Kunlik o'rtacha

# thisMonthLabel
source: this month
uz: shu oy

# transactions
source: {count} transactions
uz: {count} ta tranzaksiya

source: Recent Expenses
uz: So'nggi xarajatlar

source: See All
uz: Hammasini ko'rish

source: Top Categories
uz: Eng ko'p sarflangan turkumlar

source: This Month
uz: Shu oy

# recentExpensesEmptyTitle
source: Your recent expenses will appear here
uz: So'nggi xarajatlaringiz shu yerda paydo bo'ladi

# recentExpensesEmptyMessage
source: Start tracking your spending by adding your first expense!
uz: Birinchi xarajatingizni qo'shish orqali xarajatlaringizni kuzatishni boshlang!

# minutesAgo
source: {minutes}m ago
uz: {minutes} daaqiqa avval

# hoursAgo
source: {hours}h ago
uz: {hours} soat aval

# daysAgo
source: {days}d ago
uz: {days} kun avval
